part_02/02_test_case-cavity_with_hole/snappyHexMesh/steadyState/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

nCells 200;
scale1 5;
scale2 0.2;


vertices
(
    (0 0 0)    // v0
    (1 0 0)    // v1
    (1 1 0)    // v2
    (0 1 0)    // v3
    (0 0 0.1)  // v4 
    (1 0 0.1)  // v5
    (1 1 0.1)  // v6
    (0 1 0.1)  // v7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nCells $nCells 1) 
    //simpleGrading (1 1 1)
    // scale on bot sides 
    // ( % direction x1 = 50%; % of # cells = 50%; expansion ratio=3 ) ...
    simpleGrading (
	( 
	  (50 50 $scale1)
	  (50 50 $scale2) 
	)
	( 
	  (50 50 $scale1)
	  (50 50 $scale2)
	)
	1
    )
	
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
