part_02/02_test_case-cavity_with_hole/snappyHexMesh/steadyState/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;

snap            on;

addLayers       on;

geometry
{
    cross
    {
        type triSurfaceMesh;
        file "cross.stl";
    }
}

castellatedMeshControls
{
    features
    (
    );

    refinementSurfaces
    {
        cross
        {
            level (0 0);
            patchInfo { type wall; }
        }
    }

    // delete "-disabled" below to enable refinementRegions
    refinementRegions-disabled
    {
        <surface>
        {
            mode    inside;
            level   2;
        }
    }

    insidePoint (0 0 0);
    nCellsBetweenLevels 3;
}

snapControls
{
    explicitFeatureSnap    off;
    implicitFeatureSnap    on;
}

addLayersControls
{
    layers
    {
        "cross.*" { nSurfaceLayers 3; }
    }

    relativeSizes       yes; // off, usually with firstLayerThickness
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        0.2;
    firstLayerThickness-disabled 0;
    maxThicknessToMedialRatio-disabled 0.3;
}

// delete "-disabled" to output mesh data, e.g. for layers
writeFlags-disabled
(
    scalarLevels
    layerSets
    layerFields
);

mergeTolerance 1e-6;

// ************************************************************************* //
